app/controllers/posts_controller.rb

  def index
    if params[:author_id] # when the user navigates to /authors/:id/posts
      @posts = Author.find(params[:author_id]).posts
    else
    @posts = Post.all # when the user navigates to /posts
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts"